HELP_CMD = """
ToDoList бот для создания и управления задачами. Уведомляет при наступлении даты исполнения задачи.
"""

START_MENU_TEXT = """
Я бот для создания и управления задачами.
Создай задачу, установи дату выполнения и жди уведомление с напоминанием
"""

USER_TASKS_TEXT = "Твои задачи"
TASK_CREATION_TEXT = "Добавить новую задачу"

ADD_TITLE_TEXT = "Добавь название задачи:"
ADD_DESC_TEXT = "Добавь описание задачи (необязательно):"
ADD_CATEGORY_TEXT = "Добавь категорию задачи из представленных ниже:"
ADD_DUE_DATE_TEXT = "Добавь дату выполнения задачи (в формате ГГГГ-ММ-ДД ЧЧ:ММ, например, 2026-02-10 14:00):"
APPROVE_TASK_CREATION_TEXT = "Подтвердить"
